zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_S50.h
#define S50_ELS_STATUS_DTRNG_BUSY_MASK           (0x400U)
#define S50_ELS_STATUS_DTRNG_BUSY_SHIFT          (10U)
/*! dtrng_busy - When set, it indicates the DTRNG is gathering entropy */
#define S50_ELS_STATUS_DTRNG_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << S50_ELS_STATUS_DTRNG_BUSY_SHIFT)) & S50_ELS_STATUS_DTRNG_BUSY_MASK)

#define S50_ELS_STATUS_GDET_IRQ_POS_MASK         (0x800U)
#define S50_ELS_STATUS_GDET_IRQ_POS_SHIFT        (11U)
/*! gdet_irq_pos - IRQ for GDET has detected a negative glitch: active high irq */
#define S50_ELS_STATUS_GDET_IRQ_POS(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_STATUS_GDET_IRQ_POS_SHIFT)) & S50_ELS_STATUS_GDET_IRQ_POS_MASK)

#define S50_ELS_STATUS_GDET_IRQ_NEG_MASK         (0x1000U)
#define S50_ELS_STATUS_GDET_IRQ_NEG_SHIFT        (12U)
/*! gdet_irq_neg - IRQ for GDET has detected a positive glitch: active high irq */
#define S50_ELS_STATUS_GDET_IRQ_NEG(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_STATUS_GDET_IRQ_NEG_SHIFT)) & S50_ELS_STATUS_GDET_IRQ_NEG_MASK)

#define S50_ELS_STATUS_STATUS_RSVD_MASK          (0xFFFFE000U)
#define S50_ELS_STATUS_STATUS_RSVD_SHIFT         (13U)
/*! status_rsvd - reserved */
#define S50_ELS_STATUS_STATUS_RSVD(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_STATUS_STATUS_RSVD_SHIFT)) & S50_ELS_STATUS_STATUS_RSVD_MASK)
/*! @} */

/*! @name ELS_CTRL - ELS Control register */
/*! @{ */

#define S50_ELS_CTRL_ELS_EN_MASK                 (0x1U)
#define S50_ELS_CTRL_ELS_EN_SHIFT                (0U)
/*! els_en - ELS enable 0=ELS disabled, 1= ELS is enabled */
#define S50_ELS_CTRL_ELS_EN(x)                   (((uint32_t)(((uint32_t)(x)) << S50_ELS_CTRL_ELS_EN_SHIFT)) & S50_ELS_CTRL_ELS_EN_MASK)

#define S50_ELS_CTRL_ELS_START_MASK              (0x2U)
#define S50_ELS_CTRL_ELS_START_SHIFT             (1U)
/*! els_start - Write to 1 to start a ELS Operation */
#define S50_ELS_CTRL_ELS_START(x)                (((uint32_t)(((uint32_t)(x)) << S50_ELS_CTRL_ELS_START_SHIFT)) & S50_ELS_CTRL_ELS_START_MASK)

#define S50_ELS_CTRL_ELS_RESET_MASK              (0x4U)
#define S50_ELS_CTRL_ELS_RESET_SHIFT             (2U)
/*! els_reset - Write to 1 to perform a ELS synchronous Reset */
#define S50_ELS_CTRL_ELS_RESET(x)                (((uint32_t)(((uint32_t)(x)) << S50_ELS_CTRL_ELS_RESET_SHIFT)) & S50_ELS_CTRL_ELS_RESET_MASK)

#define S50_ELS_CTRL_ELS_CMD_MASK                (0xF8U)
#define S50_ELS_CTRL_ELS_CMD_SHIFT               (3U)
/*! els_cmd - ELS Command Field: List of Valid commands: */
#define S50_ELS_CTRL_ELS_CMD(x)                  (((uint32_t)(((uint32_t)(x)) << S50_ELS_CTRL_ELS_CMD_SHIFT)) & S50_ELS_CTRL_ELS_CMD_MASK)

#define S50_ELS_CTRL_BYTE_ORDER_MASK             (0x100U)
#define S50_ELS_CTRL_BYTE_ORDER_SHIFT            (8U)
/*! byte_order - Defines Endianness - 1: BigEndian, 0: Little Endian */
#define S50_ELS_CTRL_BYTE_ORDER(x)               (((uint32_t)(((uint32_t)(x)) << S50_ELS_CTRL_BYTE_ORDER_SHIFT)) & S50_ELS_CTRL_BYTE_ORDER_MASK)

#define S50_ELS_CTRL_CTRL_RFU_MASK               (0xFFFFFE00U)
#define S50_ELS_CTRL_CTRL_RFU_SHIFT              (9U)
/*! ctrl_rfu - reserved */
#define S50_ELS_CTRL_CTRL_RFU(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_CTRL_CTRL_RFU_SHIFT)) & S50_ELS_CTRL_CTRL_RFU_MASK)
/*! @} */

/*! @name ELS_CMDCFG0 - ELS command configuration register */
/*! @{ */

#define S50_ELS_CMDCFG0_CMDCFG0_MASK             (0xFFFFFFFFU)
#define S50_ELS_CMDCFG0_CMDCFG0_SHIFT            (0U)
/*! cmdcfg0 - refer to reference manual for assignment of this field */
#define S50_ELS_CMDCFG0_CMDCFG0(x)               (((uint32_t)(((uint32_t)(x)) << S50_ELS_CMDCFG0_CMDCFG0_SHIFT)) & S50_ELS_CMDCFG0_CMDCFG0_MASK)
/*! @} */

/*! @name ELS_CFG - ELS configuration register */
/*! @{ */

#define S50_ELS_CFG_CFG_RSVD0_MASK               (0xFFFFU)
#define S50_ELS_CFG_CFG_RSVD0_SHIFT              (0U)
/*! cfg_rsvd0 - reserved */
#define S50_ELS_CFG_CFG_RSVD0(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_CFG_CFG_RSVD0_SHIFT)) & S50_ELS_CFG_CFG_RSVD0_MASK)

#define S50_ELS_CFG_ADCTRL_MASK                  (0x3FF0000U)
#define S50_ELS_CFG_ADCTRL_SHIFT                 (16U)
/*! adctrl - maximum aes start delay */
#define S50_ELS_CFG_ADCTRL(x)                    (((uint32_t)(((uint32_t)(x)) << S50_ELS_CFG_ADCTRL_SHIFT)) & S50_ELS_CFG_ADCTRL_MASK)

#define S50_ELS_CFG_CFG_RSVD1_MASK               (0x7C000000U)
#define S50_ELS_CFG_CFG_RSVD1_SHIFT              (26U)
/*! cfg_rsvd1 - reserved */
#define S50_ELS_CFG_CFG_RSVD1(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_CFG_CFG_RSVD1_SHIFT)) & S50_ELS_CFG_CFG_RSVD1_MASK)

#define S50_ELS_CFG_SHA2_DIRECT_MASK             (0x80000000U)
#define S50_ELS_CFG_SHA2_DIRECT_SHIFT            (31U)
/*! sha2_direct - 1=enable sha2 direct mode: direct access from external */
#define S50_ELS_CFG_SHA2_DIRECT(x)               (((uint32_t)(((uint32_t)(x)) << S50_ELS_CFG_SHA2_DIRECT_SHIFT)) & S50_ELS_CFG_SHA2_DIRECT_MASK)
/*! @} */

/*! @name ELS_KIDX0 - Keystore index 0 - for commands that access a single key */
/*! @{ */

#define S50_ELS_KIDX0_KIDX0_MASK                 (0x7FU)
#define S50_ELS_KIDX0_KIDX0_SHIFT                (0U)
/*! kidx0 - keystore is indexed as an array of 128 bit key slots */
#define S50_ELS_KIDX0_KIDX0(x)                   (((uint32_t)(((uint32_t)(x)) << S50_ELS_KIDX0_KIDX0_SHIFT)) & S50_ELS_KIDX0_KIDX0_MASK)

#define S50_ELS_KIDX0_KIDX0_RSVD_MASK            (0xFFFFFF80U)
#define S50_ELS_KIDX0_KIDX0_RSVD_SHIFT           (7U)
/*! kidx0_rsvd - reserved */
#define S50_ELS_KIDX0_KIDX0_RSVD(x)              (((uint32_t)(((uint32_t)(x)) << S50_ELS_KIDX0_KIDX0_RSVD_SHIFT)) & S50_ELS_KIDX0_KIDX0_RSVD_MASK)
/*! @} */

/*! @name ELS_KIDX1 - Keystore index 1 - for commands that access 2 keys */
/*! @{ */

#define S50_ELS_KIDX1_KIDX1_MASK                 (0x7FU)
#define S50_ELS_KIDX1_KIDX1_SHIFT                (0U)
/*! kidx1 - keystore is indexed as an array of 128 bit key slots */
#define S50_ELS_KIDX1_KIDX1(x)                   (((uint32_t)(((uint32_t)(x)) << S50_ELS_KIDX1_KIDX1_SHIFT)) & S50_ELS_KIDX1_KIDX1_MASK)

#define S50_ELS_KIDX1_KIDX1_RSVD_MASK            (0xFFFFFF80U)
#define S50_ELS_KIDX1_KIDX1_RSVD_SHIFT           (7U)
/*! kidx1_rsvd - reserved */
#define S50_ELS_KIDX1_KIDX1_RSVD(x)              (((uint32_t)(((uint32_t)(x)) << S50_ELS_KIDX1_KIDX1_RSVD_SHIFT)) & S50_ELS_KIDX1_KIDX1_RSVD_MASK)
/*! @} */

/*! @name ELS_KPROPIN - key properties request */
/*! @{ */

#define S50_ELS_KPROPIN_KPROPIN_MASK             (0xFFFFFFFFU)
#define S50_ELS_KPROPIN_KPROPIN_SHIFT            (0U)
/*! kpropin - for commands that create a key - requested properties */
#define S50_ELS_KPROPIN_KPROPIN(x)               (((uint32_t)(((uint32_t)(x)) << S50_ELS_KPROPIN_KPROPIN_SHIFT)) & S50_ELS_KPROPIN_KPROPIN_MASK)
/*! @} */

/*! @name ELS_DMA_SRC0 - ELS DMA Source 0 */
/*! @{ */

#define S50_ELS_DMA_SRC0_ADDR_SRC0_MASK          (0xFFFFFFFFU)
#define S50_ELS_DMA_SRC0_ADDR_SRC0_SHIFT         (0U)
/*! addr_src0 - defines the System address of the start of the */
#define S50_ELS_DMA_SRC0_ADDR_SRC0(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_SRC0_ADDR_SRC0_SHIFT)) & S50_ELS_DMA_SRC0_ADDR_SRC0_MASK)
/*! @} */

/*! @name ELS_DMA_SRC0_LEN - ELS DMA Source 0 length */
/*! @{ */

#define S50_ELS_DMA_SRC0_LEN_SIZE_SRC0_LEN_MASK  (0xFFFFFFFFU)
#define S50_ELS_DMA_SRC0_LEN_SIZE_SRC0_LEN_SHIFT (0U)
/*! size_src0_len - Size in bytes of the data to be transferred from */
#define S50_ELS_DMA_SRC0_LEN_SIZE_SRC0_LEN(x)    (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_SRC0_LEN_SIZE_SRC0_LEN_SHIFT)) & S50_ELS_DMA_SRC0_LEN_SIZE_SRC0_LEN_MASK)
/*! @} */

