zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_S50.h
/*! @name ELS_DMA_SRC1 - ELS DMA Source 1 */
/*! @{ */

#define S50_ELS_DMA_SRC1_ADDR_SRC1_MASK          (0xFFFFFFFFU)
#define S50_ELS_DMA_SRC1_ADDR_SRC1_SHIFT         (0U)
/*! addr_src1 - defines the System address of the start of the */
#define S50_ELS_DMA_SRC1_ADDR_SRC1(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_SRC1_ADDR_SRC1_SHIFT)) & S50_ELS_DMA_SRC1_ADDR_SRC1_MASK)
/*! @} */

/*! @name ELS_DMA_SRC2 - ELS DMA Source 2 */
/*! @{ */

#define S50_ELS_DMA_SRC2_ADDR_SRC2_MASK          (0xFFFFFFFFU)
#define S50_ELS_DMA_SRC2_ADDR_SRC2_SHIFT         (0U)
/*! addr_src2 - defines the System address of the start of the */
#define S50_ELS_DMA_SRC2_ADDR_SRC2(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_SRC2_ADDR_SRC2_SHIFT)) & S50_ELS_DMA_SRC2_ADDR_SRC2_MASK)
/*! @} */

/*! @name ELS_DMA_SRC2_LEN - ELS DMA Source 2 length */
/*! @{ */

#define S50_ELS_DMA_SRC2_LEN_SIZE_SRC2_LEN_MASK  (0xFFFFFFFFU)
#define S50_ELS_DMA_SRC2_LEN_SIZE_SRC2_LEN_SHIFT (0U)
/*! size_src2_len - Size in bytes of the data to be transferred from */
#define S50_ELS_DMA_SRC2_LEN_SIZE_SRC2_LEN(x)    (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_SRC2_LEN_SIZE_SRC2_LEN_SHIFT)) & S50_ELS_DMA_SRC2_LEN_SIZE_SRC2_LEN_MASK)
/*! @} */

/*! @name ELS_DMA_RES0 - ELS DMA Result 0 */
/*! @{ */

#define S50_ELS_DMA_RES0_ADDR_RES0_MASK          (0xFFFFFFFFU)
#define S50_ELS_DMA_RES0_ADDR_RES0_SHIFT         (0U)
/*! addr_res0 - defines the System Start address of where the result */
#define S50_ELS_DMA_RES0_ADDR_RES0(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_RES0_ADDR_RES0_SHIFT)) & S50_ELS_DMA_RES0_ADDR_RES0_MASK)
/*! @} */

/*! @name ELS_DMA_RES0_LEN - ELS DMA Result 0 Size */
/*! @{ */

#define S50_ELS_DMA_RES0_LEN_SIZE_RES0_LEN_MASK  (0xFFFFFFFFU)
#define S50_ELS_DMA_RES0_LEN_SIZE_RES0_LEN_SHIFT (0U)
/*! size_res0_len - Size in bytes of the data to be transferred to */
#define S50_ELS_DMA_RES0_LEN_SIZE_RES0_LEN(x)    (((uint32_t)(((uint32_t)(x)) << S50_ELS_DMA_RES0_LEN_SIZE_RES0_LEN_SHIFT)) & S50_ELS_DMA_RES0_LEN_SIZE_RES0_LEN_MASK)
/*! @} */

/*! @name ELS_INT_ENABLE - Interrupt enable */
/*! @{ */

#define S50_ELS_INT_ENABLE_INT_EN_MASK           (0x1U)
#define S50_ELS_INT_ENABLE_INT_EN_SHIFT          (0U)
/*! int_en - Interrupt enable bit */
#define S50_ELS_INT_ENABLE_INT_EN(x)             (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_ENABLE_INT_EN_SHIFT)) & S50_ELS_INT_ENABLE_INT_EN_MASK)

#define S50_ELS_INT_ENABLE_GDET_INT_EN_MASK      (0x2U)
#define S50_ELS_INT_ENABLE_GDET_INT_EN_SHIFT     (1U)
/*! gdet_int_en - GDET Interrupt enable bit */
#define S50_ELS_INT_ENABLE_GDET_INT_EN(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_ENABLE_GDET_INT_EN_SHIFT)) & S50_ELS_INT_ENABLE_GDET_INT_EN_MASK)

#define S50_ELS_INT_ENABLE_INT_ENA_RSVD_MASK     (0xFFFFFFFCU)
#define S50_ELS_INT_ENABLE_INT_ENA_RSVD_SHIFT    (2U)
/*! int_ena_rsvd - reserved */
#define S50_ELS_INT_ENABLE_INT_ENA_RSVD(x)       (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_ENABLE_INT_ENA_RSVD_SHIFT)) & S50_ELS_INT_ENABLE_INT_ENA_RSVD_MASK)
/*! @} */

/*! @name ELS_INT_STATUS_CLR - Interrupt status clear */
/*! @{ */

#define S50_ELS_INT_STATUS_CLR_INT_CLR_MASK      (0x1U)
#define S50_ELS_INT_STATUS_CLR_INT_CLR_SHIFT     (0U)
/*! int_clr - Interrupt status clear */
#define S50_ELS_INT_STATUS_CLR_INT_CLR(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_CLR_INT_CLR_SHIFT)) & S50_ELS_INT_STATUS_CLR_INT_CLR_MASK)

#define S50_ELS_INT_STATUS_CLR_GDET_INT_CLR_MASK (0x2U)
#define S50_ELS_INT_STATUS_CLR_GDET_INT_CLR_SHIFT (1U)
/*! gdet_int_clr - GDET Interrupt status clear */
#define S50_ELS_INT_STATUS_CLR_GDET_INT_CLR(x)   (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_CLR_GDET_INT_CLR_SHIFT)) & S50_ELS_INT_STATUS_CLR_GDET_INT_CLR_MASK)

#define S50_ELS_INT_STATUS_CLR_INT_STSC_RSVD_MASK (0xFFFFFFFCU)
#define S50_ELS_INT_STATUS_CLR_INT_STSC_RSVD_SHIFT (2U)
/*! int_stsc_rsvd - reserved */
#define S50_ELS_INT_STATUS_CLR_INT_STSC_RSVD(x)  (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_CLR_INT_STSC_RSVD_SHIFT)) & S50_ELS_INT_STATUS_CLR_INT_STSC_RSVD_MASK)
/*! @} */

/*! @name ELS_INT_STATUS_SET - Interrupt status set */
/*! @{ */

#define S50_ELS_INT_STATUS_SET_INT_SET_MASK      (0x1U)
#define S50_ELS_INT_STATUS_SET_INT_SET_SHIFT     (0U)
/*! int_set - Set interrupt by software */
#define S50_ELS_INT_STATUS_SET_INT_SET(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_SET_INT_SET_SHIFT)) & S50_ELS_INT_STATUS_SET_INT_SET_MASK)

#define S50_ELS_INT_STATUS_SET_GDET_INT_NEG_SET_MASK (0x2U)
#define S50_ELS_INT_STATUS_SET_GDET_INT_NEG_SET_SHIFT (1U)
/*! gdet_int_neg_set - Set GDET interrupt by software */
#define S50_ELS_INT_STATUS_SET_GDET_INT_NEG_SET(x) (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_SET_GDET_INT_NEG_SET_SHIFT)) & S50_ELS_INT_STATUS_SET_GDET_INT_NEG_SET_MASK)

#define S50_ELS_INT_STATUS_SET_GDET_INT_POS_SET_MASK (0x4U)
#define S50_ELS_INT_STATUS_SET_GDET_INT_POS_SET_SHIFT (2U)
/*! gdet_int_pos_set - Set GDET interrupt by software */
#define S50_ELS_INT_STATUS_SET_GDET_INT_POS_SET(x) (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_SET_GDET_INT_POS_SET_SHIFT)) & S50_ELS_INT_STATUS_SET_GDET_INT_POS_SET_MASK)

#define S50_ELS_INT_STATUS_SET_INT_STSS_RSVD_MASK (0xFFFFFFF8U)
#define S50_ELS_INT_STATUS_SET_INT_STSS_RSVD_SHIFT (3U)
/*! int_stss_rsvd - reserved */
#define S50_ELS_INT_STATUS_SET_INT_STSS_RSVD(x)  (((uint32_t)(((uint32_t)(x)) << S50_ELS_INT_STATUS_SET_INT_STSS_RSVD_SHIFT)) & S50_ELS_INT_STATUS_SET_INT_STSS_RSVD_MASK)
/*! @} */

/*! @name ELS_ERR_STATUS - Status register */
/*! @{ */

#define S50_ELS_ERR_STATUS_BUS_ERR_MASK          (0x1U)
#define S50_ELS_ERR_STATUS_BUS_ERR_SHIFT         (0U)
/*! bus_err - Bus access error: public or private bus */
#define S50_ELS_ERR_STATUS_BUS_ERR(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_BUS_ERR_SHIFT)) & S50_ELS_ERR_STATUS_BUS_ERR_MASK)

#define S50_ELS_ERR_STATUS_OPN_ERR_MASK          (0x2U)
#define S50_ELS_ERR_STATUS_OPN_ERR_SHIFT         (1U)
/*! opn_err - Operational error: */
#define S50_ELS_ERR_STATUS_OPN_ERR(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_OPN_ERR_SHIFT)) & S50_ELS_ERR_STATUS_OPN_ERR_MASK)

#define S50_ELS_ERR_STATUS_ALG_ERR_MASK          (0x4U)
#define S50_ELS_ERR_STATUS_ALG_ERR_SHIFT         (2U)
/*! alg_err - Algorithm error: An internal algorithm has */
#define S50_ELS_ERR_STATUS_ALG_ERR(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_ALG_ERR_SHIFT)) & S50_ELS_ERR_STATUS_ALG_ERR_MASK)

#define S50_ELS_ERR_STATUS_ITG_ERR_MASK          (0x8U)
#define S50_ELS_ERR_STATUS_ITG_ERR_SHIFT         (3U)
/*! itg_err - Data integrity error: */
#define S50_ELS_ERR_STATUS_ITG_ERR(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_ITG_ERR_SHIFT)) & S50_ELS_ERR_STATUS_ITG_ERR_MASK)

#define S50_ELS_ERR_STATUS_FLT_ERR_MASK          (0x10U)
#define S50_ELS_ERR_STATUS_FLT_ERR_SHIFT         (4U)
/*! flt_err - Hardware fault error: Attempt to change the value */
#define S50_ELS_ERR_STATUS_FLT_ERR(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_FLT_ERR_SHIFT)) & S50_ELS_ERR_STATUS_FLT_ERR_MASK)

#define S50_ELS_ERR_STATUS_PRNG_ERR_MASK         (0x20U)
#define S50_ELS_ERR_STATUS_PRNG_ERR_SHIFT        (5U)
/*! prng_err - User Read of ELS_PRNG_DATOUT when ELS_STATUS.PRNG_RDY */
#define S50_ELS_ERR_STATUS_PRNG_ERR(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_PRNG_ERR_SHIFT)) & S50_ELS_ERR_STATUS_PRNG_ERR_MASK)

#define S50_ELS_ERR_STATUS_ERR_LVL_MASK          (0xC0U)
#define S50_ELS_ERR_STATUS_ERR_LVL_SHIFT         (6U)
/*! err_lvl - Indicates Error Level which has been triggerer. 0, 1 ,2 */
#define S50_ELS_ERR_STATUS_ERR_LVL(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_ERR_LVL_SHIFT)) & S50_ELS_ERR_STATUS_ERR_LVL_MASK)

#define S50_ELS_ERR_STATUS_DTRNG_ERR_MASK        (0x100U)
#define S50_ELS_ERR_STATUS_DTRNG_ERR_SHIFT       (8U)
/*! dtrng_err - DTRNG unable to gather entropy with the current */
#define S50_ELS_ERR_STATUS_DTRNG_ERR(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_DTRNG_ERR_SHIFT)) & S50_ELS_ERR_STATUS_DTRNG_ERR_MASK)

#define S50_ELS_ERR_STATUS_ERR_STAT_RSVD_MASK    (0xFFFFFE00U)
#define S50_ELS_ERR_STATUS_ERR_STAT_RSVD_SHIFT   (9U)
/*! err_stat_rsvd - reserved */
#define S50_ELS_ERR_STATUS_ERR_STAT_RSVD(x)      (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_ERR_STAT_RSVD_SHIFT)) & S50_ELS_ERR_STATUS_ERR_STAT_RSVD_MASK)
/*! @} */

