zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_S50.h
/*! @name ELS_ERR_STATUS_CLR - Interrupt status clear */
/*! @{ */

#define S50_ELS_ERR_STATUS_CLR_ERR_CLR_MASK      (0x1U)
#define S50_ELS_ERR_STATUS_CLR_ERR_CLR_SHIFT     (0U)
/*! err_clr - 1=clear ELS error status bits and exit ELS error state */
#define S50_ELS_ERR_STATUS_CLR_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_CLR_ERR_CLR_SHIFT)) & S50_ELS_ERR_STATUS_CLR_ERR_CLR_MASK)

#define S50_ELS_ERR_STATUS_CLR_ERR_STSC_RSVD_MASK (0xFFFFFFFEU)
#define S50_ELS_ERR_STATUS_CLR_ERR_STSC_RSVD_SHIFT (1U)
/*! err_stsc_rsvd - reserved */
#define S50_ELS_ERR_STATUS_CLR_ERR_STSC_RSVD(x)  (((uint32_t)(((uint32_t)(x)) << S50_ELS_ERR_STATUS_CLR_ERR_STSC_RSVD_SHIFT)) & S50_ELS_ERR_STATUS_CLR_ERR_STSC_RSVD_MASK)
/*! @} */

/*! @name ELS_VERSION - ELS Version */
/*! @{ */

#define S50_ELS_VERSION_Z_MASK                   (0xFU)
#define S50_ELS_VERSION_Z_SHIFT                  (0U)
/*! z - extended revision version: possible values 0-9 */
#define S50_ELS_VERSION_Z(x)                     (((uint32_t)(((uint32_t)(x)) << S50_ELS_VERSION_Z_SHIFT)) & S50_ELS_VERSION_Z_MASK)

#define S50_ELS_VERSION_Y2_MASK                  (0xF0U)
#define S50_ELS_VERSION_Y2_SHIFT                 (4U)
/*! y2 - minor release versino digit0: possible values 0-9 */
#define S50_ELS_VERSION_Y2(x)                    (((uint32_t)(((uint32_t)(x)) << S50_ELS_VERSION_Y2_SHIFT)) & S50_ELS_VERSION_Y2_MASK)

#define S50_ELS_VERSION_Y1_MASK                  (0xF00U)
#define S50_ELS_VERSION_Y1_SHIFT                 (8U)
/*! y1 - minor release version digit1: possible values 0-9 */
#define S50_ELS_VERSION_Y1(x)                    (((uint32_t)(((uint32_t)(x)) << S50_ELS_VERSION_Y1_SHIFT)) & S50_ELS_VERSION_Y1_MASK)

#define S50_ELS_VERSION_X_MASK                   (0xF000U)
#define S50_ELS_VERSION_X_SHIFT                  (12U)
/*! x - major release version: possible values 1-9 */
#define S50_ELS_VERSION_X(x)                     (((uint32_t)(((uint32_t)(x)) << S50_ELS_VERSION_X_SHIFT)) & S50_ELS_VERSION_X_MASK)

#define S50_ELS_VERSION_VERSION_RSVD_MASK        (0xFFFF0000U)
#define S50_ELS_VERSION_VERSION_RSVD_SHIFT       (16U)
/*! version_rsvd - reserved */
#define S50_ELS_VERSION_VERSION_RSVD(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_VERSION_VERSION_RSVD_SHIFT)) & S50_ELS_VERSION_VERSION_RSVD_MASK)
/*! @} */

/*! @name ELS_PRNG_DATOUT - PRNG SW read out register */
/*! @{ */

#define S50_ELS_PRNG_DATOUT_PRNG_DATOUT_MASK     (0xFFFFFFFFU)
#define S50_ELS_PRNG_DATOUT_PRNG_DATOUT_SHIFT    (0U)
/*! prng_datout - 32-bit wide pseudo-random number */
#define S50_ELS_PRNG_DATOUT_PRNG_DATOUT(x)       (((uint32_t)(((uint32_t)(x)) << S50_ELS_PRNG_DATOUT_PRNG_DATOUT_SHIFT)) & S50_ELS_PRNG_DATOUT_PRNG_DATOUT_MASK)
/*! @} */

/*! @name ELS_GDET_EVTCNT - ELS GDET Event Counter */
/*! @{ */

#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_MASK     (0xFFU)
#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_SHIFT    (0U)
/*! gdet_evtcnt - Number of glitch event recorded */
#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT(x)       (((uint32_t)(((uint32_t)(x)) << S50_ELS_GDET_EVTCNT_GDET_EVTCNT_SHIFT)) & S50_ELS_GDET_EVTCNT_GDET_EVTCNT_MASK)

#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_CLR_DONE_MASK (0x100U)
#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_CLR_DONE_SHIFT (8U)
/*! gdet_evtcnt_clr_done - The GDET event counter has been cleared */
#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_CLR_DONE(x) (((uint32_t)(((uint32_t)(x)) << S50_ELS_GDET_EVTCNT_GDET_EVTCNT_CLR_DONE_SHIFT)) & S50_ELS_GDET_EVTCNT_GDET_EVTCNT_CLR_DONE_MASK)

#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_RSVD_MASK (0xFFFFFE00U)
#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_RSVD_SHIFT (9U)
/*! gdet_evtcnt_rsvd - reserved */
#define S50_ELS_GDET_EVTCNT_GDET_EVTCNT_RSVD(x)  (((uint32_t)(((uint32_t)(x)) << S50_ELS_GDET_EVTCNT_GDET_EVTCNT_RSVD_SHIFT)) & S50_ELS_GDET_EVTCNT_GDET_EVTCNT_RSVD_MASK)
/*! @} */

/*! @name ELS_GDET_EVTCNT_CLR - ELS GDET Event Counter Clear */
/*! @{ */

#define S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_MASK (0x1U)
#define S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_SHIFT (0U)
/*! gdet_evtcnt_clr - 1=clear GDET event counter clear */
#define S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR(x) (((uint32_t)(((uint32_t)(x)) << S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_SHIFT)) & S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_MASK)

#define S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_RSVD_MASK (0xFFFFFFFEU)
#define S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_RSVD_SHIFT (1U)
/*! gdet_evtcnt_clr_rsvd - reserved */
#define S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_RSVD(x) (((uint32_t)(((uint32_t)(x)) << S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_RSVD_SHIFT)) & S50_ELS_GDET_EVTCNT_CLR_GDET_EVTCNT_CLR_RSVD_MASK)
/*! @} */

/*! @name ELS_SHA2_STATUS - ELS SHA2 Status Register */
/*! @{ */

#define S50_ELS_SHA2_STATUS_SHA2_BUSY_MASK       (0x1U)
#define S50_ELS_SHA2_STATUS_SHA2_BUSY_SHIFT      (0U)
/*! sha2_busy - SHA2 busy/idle status for sha direct */
#define S50_ELS_SHA2_STATUS_SHA2_BUSY(x)         (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_STATUS_SHA2_BUSY_SHIFT)) & S50_ELS_SHA2_STATUS_SHA2_BUSY_MASK)

#define S50_ELS_SHA2_STATUS_STATUS_RSVD1_MASK    (0xFFFFFFFEU)
#define S50_ELS_SHA2_STATUS_STATUS_RSVD1_SHIFT   (1U)
/*! status_rsvd1 - reserved */
#define S50_ELS_SHA2_STATUS_STATUS_RSVD1(x)      (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_STATUS_STATUS_RSVD1_SHIFT)) & S50_ELS_SHA2_STATUS_STATUS_RSVD1_MASK)
/*! @} */

/*! @name ELS_SHA2_CTRL - SHA2 Control register */
/*! @{ */

#define S50_ELS_SHA2_CTRL_SHA2_START_MASK        (0x1U)
#define S50_ELS_SHA2_CTRL_SHA2_START_SHIFT       (0U)
/*! sha2_start - Write to 1 to Init the SHA2 Module */
#define S50_ELS_SHA2_CTRL_SHA2_START(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_SHA2_START_SHIFT)) & S50_ELS_SHA2_CTRL_SHA2_START_MASK)

#define S50_ELS_SHA2_CTRL_SHA2_RST_MASK          (0x2U)
#define S50_ELS_SHA2_CTRL_SHA2_RST_SHIFT         (1U)
/*! sha2_rst - Write to 1 to Reset a SHA2 operation */
#define S50_ELS_SHA2_CTRL_SHA2_RST(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_SHA2_RST_SHIFT)) & S50_ELS_SHA2_CTRL_SHA2_RST_MASK)

