zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_S50.h
#define S50_ELS_SHA2_CTRL_SHA2_INIT_MASK         (0x4U)
#define S50_ELS_SHA2_CTRL_SHA2_INIT_SHIFT        (2U)
/*! sha2_init - Write to 1 to Init the SHA2 Kernel */
#define S50_ELS_SHA2_CTRL_SHA2_INIT(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_SHA2_INIT_SHIFT)) & S50_ELS_SHA2_CTRL_SHA2_INIT_MASK)

#define S50_ELS_SHA2_CTRL_SHA2_LOAD_MASK         (0x8U)
#define S50_ELS_SHA2_CTRL_SHA2_LOAD_SHIFT        (3U)
/*! sha2_load - Write to 1 to Load the SHA2 Kernel */
#define S50_ELS_SHA2_CTRL_SHA2_LOAD(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_SHA2_LOAD_SHIFT)) & S50_ELS_SHA2_CTRL_SHA2_LOAD_MASK)

#define S50_ELS_SHA2_CTRL_SHA2_MODE_MASK         (0x30U)
#define S50_ELS_SHA2_CTRL_SHA2_MODE_SHIFT        (4U)
/*! sha2_mode - SHA2 MODE: */
#define S50_ELS_SHA2_CTRL_SHA2_MODE(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_SHA2_MODE_SHIFT)) & S50_ELS_SHA2_CTRL_SHA2_MODE_MASK)

#define S50_ELS_SHA2_CTRL_CTRL_RSVD1_MASK        (0x1C0U)
#define S50_ELS_SHA2_CTRL_CTRL_RSVD1_SHIFT       (6U)
/*! ctrl_rsvd1 - r-eserved */
#define S50_ELS_SHA2_CTRL_CTRL_RSVD1(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_CTRL_RSVD1_SHIFT)) & S50_ELS_SHA2_CTRL_CTRL_RSVD1_MASK)

#define S50_ELS_SHA2_CTRL_SHA2_BYTE_ORDER_MASK   (0x200U)
#define S50_ELS_SHA2_CTRL_SHA2_BYTE_ORDER_SHIFT  (9U)
/*! sha2_byte_order - Write to 1 to Reverse byte endianess */
#define S50_ELS_SHA2_CTRL_SHA2_BYTE_ORDER(x)     (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_SHA2_BYTE_ORDER_SHIFT)) & S50_ELS_SHA2_CTRL_SHA2_BYTE_ORDER_MASK)

#define S50_ELS_SHA2_CTRL_CTRL_RSVD_MASK         (0xFFFFFC00U)
#define S50_ELS_SHA2_CTRL_CTRL_RSVD_SHIFT        (10U)
/*! ctrl_rsvd - r-eserved */
#define S50_ELS_SHA2_CTRL_CTRL_RSVD(x)           (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_CTRL_CTRL_RSVD_SHIFT)) & S50_ELS_SHA2_CTRL_CTRL_RSVD_MASK)
/*! @} */

/*! @name ELS_SHA2_DIN - ELS SHA_DATA IN Register 0 */
/*! @{ */

#define S50_ELS_SHA2_DIN_SHA_DATIN_MASK          (0xFFFFFFFFU)
#define S50_ELS_SHA2_DIN_SHA_DATIN_SHIFT         (0U)
/*! sha_datin - Output ELS_SHA_DATIN from ELS Application being executed */
#define S50_ELS_SHA2_DIN_SHA_DATIN(x)            (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DIN_SHA_DATIN_SHIFT)) & S50_ELS_SHA2_DIN_SHA_DATIN_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT0 - ELS ELS_SHA_DATA Out Register 0 */
/*! @{ */

#define S50_ELS_SHA2_DOUT0_SHA_DATA0_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT0_SHA_DATA0_SHIFT       (0U)
/*! sha_data0 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT0_SHA_DATA0(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT0_SHA_DATA0_SHIFT)) & S50_ELS_SHA2_DOUT0_SHA_DATA0_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT1 - ELS SHA_DATA Out Register 1 */
/*! @{ */

#define S50_ELS_SHA2_DOUT1_SHA_DATA1_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT1_SHA_DATA1_SHIFT       (0U)
/*! sha_data1 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT1_SHA_DATA1(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT1_SHA_DATA1_SHIFT)) & S50_ELS_SHA2_DOUT1_SHA_DATA1_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT2 - ELS SHA_DATA Out Register 2 */
/*! @{ */

#define S50_ELS_SHA2_DOUT2_SHA_DATA2_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT2_SHA_DATA2_SHIFT       (0U)
/*! sha_data2 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT2_SHA_DATA2(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT2_SHA_DATA2_SHIFT)) & S50_ELS_SHA2_DOUT2_SHA_DATA2_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT3 - ELS SHA_DATA Out Register 3 */
/*! @{ */

#define S50_ELS_SHA2_DOUT3_SHA_DATA3_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT3_SHA_DATA3_SHIFT       (0U)
/*! sha_data3 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT3_SHA_DATA3(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT3_SHA_DATA3_SHIFT)) & S50_ELS_SHA2_DOUT3_SHA_DATA3_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT4 - ELS SHA_DATA Out Register 4 */
/*! @{ */

#define S50_ELS_SHA2_DOUT4_SHA_DATA4_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT4_SHA_DATA4_SHIFT       (0U)
/*! sha_data4 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT4_SHA_DATA4(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT4_SHA_DATA4_SHIFT)) & S50_ELS_SHA2_DOUT4_SHA_DATA4_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT5 - ELS SHA_DATA Out Register 5 */
/*! @{ */

#define S50_ELS_SHA2_DOUT5_SHA_DATA5_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT5_SHA_DATA5_SHIFT       (0U)
/*! sha_data5 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT5_SHA_DATA5(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT5_SHA_DATA5_SHIFT)) & S50_ELS_SHA2_DOUT5_SHA_DATA5_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT6 - ELS SHA_DATA Out Register 6 */
/*! @{ */

#define S50_ELS_SHA2_DOUT6_SHA_DATA6_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT6_SHA_DATA6_SHIFT       (0U)
/*! sha_data6 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT6_SHA_DATA6(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT6_SHA_DATA6_SHIFT)) & S50_ELS_SHA2_DOUT6_SHA_DATA6_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT7 - ELS SHA_DATA Out Register 7 */
/*! @{ */

#define S50_ELS_SHA2_DOUT7_SHA_DATA7_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT7_SHA_DATA7_SHIFT       (0U)
/*! sha_data7 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT7_SHA_DATA7(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT7_SHA_DATA7_SHIFT)) & S50_ELS_SHA2_DOUT7_SHA_DATA7_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT8 - ELS ELS_SHA_DATA Out Register 8 */
/*! @{ */

#define S50_ELS_SHA2_DOUT8_SHA_DATA8_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT8_SHA_DATA8_SHIFT       (0U)
/*! sha_data8 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT8_SHA_DATA8(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT8_SHA_DATA8_SHIFT)) & S50_ELS_SHA2_DOUT8_SHA_DATA8_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT9 - ELS SHA_DATA Out Register 9 */
/*! @{ */

