zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_S50.h
#define S50_ELS_SHA2_DOUT9_SHA_DATA9_MASK        (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT9_SHA_DATA9_SHIFT       (0U)
/*! sha_data9 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT9_SHA_DATA9(x)          (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT9_SHA_DATA9_SHIFT)) & S50_ELS_SHA2_DOUT9_SHA_DATA9_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT10 - ELS SHA_DATA Out Register 10 */
/*! @{ */

#define S50_ELS_SHA2_DOUT10_SHA_DATA10_MASK      (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT10_SHA_DATA10_SHIFT     (0U)
/*! sha_data10 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT10_SHA_DATA10(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT10_SHA_DATA10_SHIFT)) & S50_ELS_SHA2_DOUT10_SHA_DATA10_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT11 - ELS SHA_DATA Out Register 11 */
/*! @{ */

#define S50_ELS_SHA2_DOUT11_SHA_DATA11_MASK      (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT11_SHA_DATA11_SHIFT     (0U)
/*! sha_data11 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT11_SHA_DATA11(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT11_SHA_DATA11_SHIFT)) & S50_ELS_SHA2_DOUT11_SHA_DATA11_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT12 - ELS SHA_DATA Out Register 12 */
/*! @{ */

#define S50_ELS_SHA2_DOUT12_SHA_DATA12_MASK      (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT12_SHA_DATA12_SHIFT     (0U)
/*! sha_data12 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT12_SHA_DATA12(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT12_SHA_DATA12_SHIFT)) & S50_ELS_SHA2_DOUT12_SHA_DATA12_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT13 - ELS SHA_DATA Out Register 13 */
/*! @{ */

#define S50_ELS_SHA2_DOUT13_SHA_DATA13_MASK      (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT13_SHA_DATA13_SHIFT     (0U)
/*! sha_data13 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT13_SHA_DATA13(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT13_SHA_DATA13_SHIFT)) & S50_ELS_SHA2_DOUT13_SHA_DATA13_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT14 - ELS SHA_DATA Out Register 14 */
/*! @{ */

#define S50_ELS_SHA2_DOUT14_SHA_DATA14_MASK      (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT14_SHA_DATA14_SHIFT     (0U)
/*! sha_data14 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT14_SHA_DATA14(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT14_SHA_DATA14_SHIFT)) & S50_ELS_SHA2_DOUT14_SHA_DATA14_MASK)
/*! @} */

/*! @name ELS_SHA2_DOUT15 - ELS SHA_DATA Out Register 15 */
/*! @{ */

#define S50_ELS_SHA2_DOUT15_SHA_DATA15_MASK      (0xFFFFFFFFU)
#define S50_ELS_SHA2_DOUT15_SHA_DATA15_SHIFT     (0U)
/*! sha_data15 - Output SHA_DATA from ELS Application being executed */
#define S50_ELS_SHA2_DOUT15_SHA_DATA15(x)        (((uint32_t)(((uint32_t)(x)) << S50_ELS_SHA2_DOUT15_SHA_DATA15_SHIFT)) & S50_ELS_SHA2_DOUT15_SHA_DATA15_MASK)
/*! @} */

/*! @name ELS_KS0 - Status register */
/*! @{ */

#define S50_ELS_KS0_KS0_KSIZE_MASK               (0x1U)
#define S50_ELS_KS0_KS0_KSIZE_SHIFT              (0U)
/*! ks0_ksize - Key size: 0-128, 1-256 */
#define S50_ELS_KS0_KS0_KSIZE(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_KSIZE_SHIFT)) & S50_ELS_KS0_KS0_KSIZE_MASK)

#define S50_ELS_KS0_KS0_RSVD0_MASK               (0x1EU)
#define S50_ELS_KS0_KS0_RSVD0_SHIFT              (1U)
/*! ks0_rsvd0 - Reserved 0 */
#define S50_ELS_KS0_KS0_RSVD0(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_RSVD0_SHIFT)) & S50_ELS_KS0_KS0_RSVD0_MASK)

#define S50_ELS_KS0_KS0_KACT_MASK                (0x20U)
#define S50_ELS_KS0_KS0_KACT_SHIFT               (5U)
/*! ks0_kact - Key is active */
#define S50_ELS_KS0_KS0_KACT(x)                  (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_KACT_SHIFT)) & S50_ELS_KS0_KS0_KACT_MASK)

#define S50_ELS_KS0_KS0_KBASE_MASK               (0x40U)
#define S50_ELS_KS0_KS0_KBASE_SHIFT              (6U)
/*! ks0_kbase - First slot in a multislot key */
#define S50_ELS_KS0_KS0_KBASE(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_KBASE_SHIFT)) & S50_ELS_KS0_KS0_KBASE_MASK)

#define S50_ELS_KS0_KS0_FGP_MASK                 (0x80U)
#define S50_ELS_KS0_KS0_FGP_SHIFT                (7U)
/*! ks0_fgp - Hardware Feature General Purpose */
#define S50_ELS_KS0_KS0_FGP(x)                   (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_FGP_SHIFT)) & S50_ELS_KS0_KS0_FGP_MASK)

#define S50_ELS_KS0_KS0_FRTN_MASK                (0x100U)
#define S50_ELS_KS0_KS0_FRTN_SHIFT               (8U)
/*! ks0_frtn - Hardware Feature Retention */
#define S50_ELS_KS0_KS0_FRTN(x)                  (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_FRTN_SHIFT)) & S50_ELS_KS0_KS0_FRTN_MASK)

#define S50_ELS_KS0_KS0_FHWO_MASK                (0x200U)
#define S50_ELS_KS0_KS0_FHWO_SHIFT               (9U)
/*! ks0_fhwo - Hardware Feature Output */
#define S50_ELS_KS0_KS0_FHWO(x)                  (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_FHWO_SHIFT)) & S50_ELS_KS0_KS0_FHWO_MASK)

#define S50_ELS_KS0_KS0_RSVD1_MASK               (0x1C00U)
#define S50_ELS_KS0_KS0_RSVD1_SHIFT              (10U)
/*! ks0_rsvd1 - Reserved 1 */
#define S50_ELS_KS0_KS0_RSVD1(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_RSVD1_SHIFT)) & S50_ELS_KS0_KS0_RSVD1_MASK)

#define S50_ELS_KS0_KS0_UCMAC_MASK               (0x2000U)
#define S50_ELS_KS0_KS0_UCMAC_SHIFT              (13U)
/*! ks0_ucmac - CMAC key */
#define S50_ELS_KS0_KS0_UCMAC(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_UCMAC_SHIFT)) & S50_ELS_KS0_KS0_UCMAC_MASK)

#define S50_ELS_KS0_KS0_UKSK_MASK                (0x4000U)
#define S50_ELS_KS0_KS0_UKSK_SHIFT               (14U)
/*! ks0_uksk - KSK key */
#define S50_ELS_KS0_KS0_UKSK(x)                  (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_UKSK_SHIFT)) & S50_ELS_KS0_KS0_UKSK_MASK)

#define S50_ELS_KS0_KS0_URTF_MASK                (0x8000U)
#define S50_ELS_KS0_KS0_URTF_SHIFT               (15U)
/*! ks0_urtf - Real Time Fingerprint key */
#define S50_ELS_KS0_KS0_URTF(x)                  (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_URTF_SHIFT)) & S50_ELS_KS0_KS0_URTF_MASK)

#define S50_ELS_KS0_KS0_UCKDF_MASK               (0x10000U)
#define S50_ELS_KS0_KS0_UCKDF_SHIFT              (16U)
/*! ks0_uckdf - Derivation key for CKDF command */
#define S50_ELS_KS0_KS0_UCKDF(x)                 (((uint32_t)(((uint32_t)(x)) << S50_ELS_KS0_KS0_UCKDF_SHIFT)) & S50_ELS_KS0_KS0_UCKDF_MASK)

